#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```golang

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```golang

tofu
module.k3s-controlplane.data.digitalocean_ssh_key.macbook: Reading...
data.digitalocean_droplets.k3s_cluster: Reading...
module.k3s-controlplane.data.digitalocean_ssh_key.macbook: Read complete after 0s [name=Personal Macbook]
data.digitalocean_droplets.k3s_cluster: Read complete after 0s [id=droplets/13355368271334101259]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # digitalocean_firewall.k3s_cluster will be created
  + resource "digitalocean_firewall" "k3s_cluster" {
      + created_at      = (known after apply)
      + droplet_ids     = [
          + 479451684,
        ]
      + id              = (known after apply)
      + name            = "k3s-cluster"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "443"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "53"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "53"
          + protocol                       = "udp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "6443"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "80"
          + protocol                       = "tcp"
        }
    }

  # digitalocean_record.k3s_theopsdev will be created
  + resource "digitalocean_record" "k3s_theopsdev" {
      + domain = "do.theops.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "k3s"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (sensitive value)
    }

  # module.k3s-controlplane.digitalocean_droplet.opsdev will be created
  + resource "digitalocean_droplet" "opsdev" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-24-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "k3s-control-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sfo3"
      + resize_disk          = true
      + size                 = "s-2vcpu-8gb"
      + ssh_keys             = [
          + "44674999",
        ]
      + status               = (known after apply)
      + tags                 = [
          + "controlplane",
          + "do-droplet",
          + "k3s",
          + "k3s-control-1",
          + "opentofu",
          + "sfo3",
          + "ubuntu-24-10-x64",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = "fce3e29f-bc4d-4edd-b19e-1780919c67c9"
    }

  # module.k3s-controlplane.digitalocean_volume.opsdev will be created
  + resource "digitalocean_volume" "opsdev" {
      + description             = "Volume for k3s-control-1"
      + droplet_ids             = (known after apply)
      + filesystem_label        = (known after apply)
      + filesystem_type         = (known after apply)
      + id                      = (known after apply)
      + initial_filesystem_type = "ext4"
      + name                    = "k3s-control-1"
      + region                  = "sfo3"
      + size                    = 25
      + tags                    = [
          + "controlplane",
          + "do-droplet",
          + "k3s",
          + "k3s-control-1",
          + "opentofu",
          + "sfo3",
          + "ubuntu-24-10-x64",
        ]
      + urn                     = (known after apply)
    }

  # module.k3s-controlplane.digitalocean_volume_attachment.opsdev will be created
  + resource "digitalocean_volume_attachment" "opsdev" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + volume_id  = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-digitalocean.plan

To perform exactly these actions, run the following command to apply:
    tofu apply "tf-digitalocean.plan"

```

</details>

*Pusher: @TheOpsDev, Action: `pull_request`, Working Directory: `opentofu/digitalocean`, Workflow: `OpenTofu Comment PR`*